swat-4-dp/src/main/soma/service-unquiesce.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
    <env:Body>
        <dp:request domain="@domain.name@" xmlns:dp="http://www.datapower.com/schemas/management">
            <dp:do-action>
                <ServiceUnquiesce>
                    <type>@service.object.class@</type>
                    <name>@service.object.name@</name>
                </ServiceUnquiesce>
            </dp:do-action>
        </dp:request>
    </env:Body>
</env:Envelope>
