swat-dp-tools/soma/xml/getfile.xml

<?xml version="1.0" encoding="UTF-8"?>
<!-- download file
    <xsd:element name="get-file">
    <xsd:complexType>
    <xsd:attribute name="name" type="xsd:string" use="required"/>
    </xsd:complexType>
    </xsd:element>
-->
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:dp="http://www.datapower.com/schemas/management">
    <soapenv:Body>
        <dp:request domain="@domain.name@" xmlns:dp="http://www.datapower.com/schemas/management">
            <dp:get-file name="@dp.file.name@" />
        </dp:request>
    </soapenv:Body>
</soapenv:Envelope>
