swat-dp-tools/soma/xml/device-export.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Body>
		<dp:request xmlns:dp="http://www.datapower.com/schemas/management" domain="default">
			<dp:do-export format="ZIP">
				<dp:object class="all-classes" name="all-objects" ref-objects="true" ref-files="true" />
			</dp:do-export>
		</dp:request>
	</soapenv:Body>
</soapenv:Envelope>